{
  "es": {
    "name": "Alejandro Rodríguez de la Cruz",
    "title": "Especialista IT | Líder de proyectos | Analista de datos | Desarrollador | QA",
    "email": "developcuba@gmail.com",
    "phone": "Mostrar teléfono",

    "nav_experiencia": "Experiencia",
    "nav_educacion": "Educación",
    "nav_tecnologias": "Tecnologías",
    "nav_competencias": "Competencias",
    "nav_portafolio": "Portafolio",
    "nav_testimonios": "Testimonios",

    "section_experiencia": "Experiencia Profesional",
    "section_educacion": "Educación",
    "section_tecnologias": "Tecnologías y Habilidades",
    "section_competencias": "Competencias",
    "section_portafolio": "Portafolio",
    "section_testimonios": "Testimonios",

    "job_especialista": "Especialista A en Ciencias Informáticas",
    "job_lead_dev": "Desarrollador Principal de Software",
    "job_director": "Director UIN Informática",
    "job_desarrollador": "Desarrollador de Software",
    "job_ia": "Especialista en Programación, Análisis de Datos y Gestión de Proyectos con IA",
    "job_php_ai": "Desarrollador PHP Codeigniter Python AI",

    "company_fortes": "Centro FORTES, Universidad de las Ciencias Informáticas (UCI)",
    "company_sitrans": "Empresa SITRANS",
    "company_ingenius": "MIPYME Ingenius SURL",
    "company_uin": "UIN Desarrollo TIC",
    "company_routetogrow": "RouteToGrow",

    "desc_fortes": "Líder de la línea de producción de multimedia y juegos educativos. Coordinación de equipos técnicos y diseño de contenidos interactivos.",
    "desc_sitrans": "Liderazgo en el desarrollo de sistemas clave como: APK <em>Viajando</em>, sistema contable <em>CONDOR</em>, y plataforma de paquetería <em>TRANSIPACK</em>. Desarrollo de portales web, planificación estratégica de proyectos y dirección técnica de equipos multidisciplinarios.",
    "desc_director": "Dirección del área de informática, supervisión de proyectos tecnológicos y gestión de infraestructura TI.",
    "desc_ingenius": "Participación en el desarrollo de soluciones tecnológicas para pymes, con enfoque en automatización y eficiencia operativa.",
    "desc_uin": "Liderazgo en el desarrollo y mantenimiento de la plataforma <em>Viajando</em>. Coordinación de equipos en proyectos tecnológicos para el Ministerio del Transporte, con integración de inteligencia artificial y análisis de datos.",
    "desc_routetogrow": "Desarrollo de funcionalidades con integración IA para CRM.",

    "edu_engineer": "Ingeniero en Ciencias Informáticas",
    "edu_diploma": "Diplomado en Redes y Seguridad Informática",
    "edu_uci": "Universidad de las Ciencias Informáticas",
    "edu_cecan": "CECAN-SEPSA",
    "edu_havana": "La Habana-Cuba",
    "edu_havana_short": "La Habana",

    "portfolio_viajando": "APK Viajando",
    "portfolio_condor": "Sistema Contable CONDOR",
    "portfolio_transipack": "TRANSIPACK",
    "portfolio_cubex": "Portal Web Cubanacan Express",
    "portfolio_reporte": "Sistema de reporte",
    "portfolio_ip": "Sistema para la Asignación automática de IP",
    "portfolio_esquina": "La Esquina Roja",
    "portfolio_comicasa": "COMICASA. Integración Glide - Make - Stripe",
    "portfolio_n8n": "Agente para ventas",
    "portfolio_powerbi": "Dashboard PowerBI",
    "portfolio_siescribo": "Red social SIESCRIBO",
    "portfolio_efirma":"Integración Portal Web EFIRMA.cu",

    "desc_viajando": "Aplicación móvil para la gestión de viajes y transporte en Cuba. Lideré su desarrollo desde cero y su mantenimiento continuo.",
    "desc_condor": "Sistema contable para la gestión financiera de empresas. Implementé funcionalidades clave y aseguré su integración con otros sistemas.",
    "desc_transipack": "Plataforma de paquetería que optimiza la logística de envíos. Participé en su diseño y desarrollo, enfocándome en la experiencia del usuario.",
    "desc_cubex": "Portal web para la gestión de envíos y logística. Colaboré en su desarrollo y en la implementación de mejoras continuas.",
    "desc_reporte": "Sistema de reporte para la visualización de datos clave. Desarrollé su arquitectura y aseguré su escalabilidad.",
    "desc_ip": "Sistema para la asignación automática de IPs en redes. Implementé soluciones que mejoraron la eficiencia del proceso.",
    "desc_esquina": "Plataforma de gestión cultural y artística. Lideré su desarrollo y promoción en la comunidad.",
    "desc_comicasa": "Integración de herramientas como Glide, Make y Stripe para optimizar procesos en COMICASA.",
    "desc_n8n": "Desarrollo de un agente para ventas utilizando n8n, mejorando la automatización de procesos comerciales.",
    "desc_powerbi": "Dashboard interactivo en PowerBI para la visualización de datos empresariales.",
    "desc_siescribo": "Red social para escritores, permite la venta de libros, socializar con lectores y escritores.",
    "desc_efirma": "Integración Portal web promocional para la solicitud de firmas digitales en Cuba",

    "tech_os": "Sistemas Operativos",
    "tech_vm": "Máquinas Virtuales",
    "tech_servers": "Servidores",
    "tech_db": "Base de Datos",
    "tech_frontend": "Frontend",
    "tech_backend": "Backend",
    "tech_frameworks": "Frameworks",
    "tech_cms": "CMS",
    "tech_ai": "IA",
    "tech_other": "Otras",
    "tech_methods": "Metodologías",
    "tech_gateways": "Pasarelas",

    "comp_design": "Experiencia en el diseño, desarrollo y mantenimiento de aplicaciones y sistemas",
    "comp_lead": "Capacidad para dirigir equipos de trabajos",
    "comp_solve": "Habilidad para identificar y solucionar problemas técnicos de manera eficiente",
    "comp_collab": "Capacidad para colaborar con otros profesionales de diferentes áreas",
    "comp_project": "Experiencia en la planificación y ejecución de proyectos de desarrollo de software",
    "comp_infra": "Despliegue de infraestructura",
    "comp_update": "Interés por estar al día con las últimas tecnologías",
    "comp_incidents": "Resolución de incidencias en hardware/software",
    "comp_scripting": "Scripting (Python, Bash) para optimizar tareas repetitivas",
    "comp_innovate": "Capacidad para proponer soluciones innovadoras a problemas técnicos",
    "comp_analyze": "Capacidad para analizar y evaluar diferentes enfoques para la resolución de problemas técnicos",
    "comp_data": "Análisis de datos",
    "comp_ai": "Integración con modelos de IA",
    "comp_migrate": "Planificación de migraciones tecnológicas (ej: actualización de sistemas legacy)",
    "comp_testing": "Pruebas manuales y semiautomatizadas",
    "comp_crm": "Experiencia en CRM y sistemas contables",
    "comp_cuban": "Conocimiento de regulaciones cubanas (ej: Normas NC-ISO 27001, Ley de Protección de Datos)",
    "comp_iso": "Conocimiento de la norma internacional ISO 9001:15",
    "comp_teams": "Liderazgo de equipos técnicos (desarrolladores, QA, DevOps)",
    "comp_stakeholders": "Gestión de stakeholders (clientes, equipos internos, proveedores)",
    "comp_budget": "Presupuesto y ROI: Planificación financiera, control de costos",
    "comp_risk": "Gestión de riesgos: Identificación y mitigación en entornos tech",
    "comp_digital": "Transformación digital: Experiencia en migración a cloud, IA, automatización",
    "comp_product": "Product Manager: Visión de producto",
    "comp_innovation": "Innovación: Conocimiento en tendencias tech (IA)",

    "testimonial_1": "Trabajar contigo ha sido una experiencia enriquecedora: eres meticuloso, colaborativo y siempre buscas la excelencia. Tu dedicación, paciencia y pasión por lo que haces elevan cada proyecto a su mejor versión.",
    "testimonial_2": "Mi experiencia trabajando con Alejandro ha sido una de las mejores en mucho tiempo. Mucha seriedad, sacrificio, entrega, dedicación. Profesionalidad ante todo.",
    "testimonial_3": "Especialista IT que sabe tener claridad, compromiso y brindar soluciones técnicas de alto nivel. Un líder nato en entornos complejos.",
    "testimonial_4": "Trabajar con Alejandro ha sido una experiencia excelente. Su dominio en el desarrollo de aplicaciones móviles y, especialmente, en la integración de pasarelas de pago, es impresionante. Desde la selección de la solución más adecuada hasta la implementación y pruebas, Alejandro demuestra un alto nivel de conocimiento técnico y atención al detalle. Su capacidad para optimizar procesos de pago y garantizar transacciones seguras ha sido clave para el éxito de nuestros proyectos. Sin duda, un profesional altamente recomendado para cualquier desarrollo móvil que requiera soluciones de pago confiables y eficientes.",
    "testimonial_5": "Tuve el placer de trabajar junto a Alejandro, es un excelente profesional con experiencia liderando equipos y tratando a clientes. En el corto tiempo que trabaje en Sitrans lo ví desempeñarse muy bien en todas las tareas y muchas veces bajo la presión de mm diferentes momentos, lo que lo hace excelente para resolver problemas bajo tensión."
  },
  "en": {
    "name": "Alejandro Rodríguez de la Cruz",
    "title": "IT Specialist | Project Leader | Data Analyst | Developer | QA",
    "email": "developcuba@gmail.com",
    "phone": "Show phone",

    "nav_experiencia": "Experience",
    "nav_educacion": "Education",
    "nav_tecnologias": "Technologies",
    "nav_competencias": "Skills",
    "nav_portafolio": "Portfolio",
    "nav_testimonios": "Testimonials",

    "section_experiencia": "Professional Experience",
    "section_educacion": "Education",
    "section_tecnologias": "Technologies and Skills",
    "section_competencias": "Skills",
    "section_portafolio": "Portfolio",
    "section_testimonios": "Testimonials",

    "job_especialista": "Specialist A in Computer Science",
    "job_lead_dev": "Lead Software Developer",
    "job_director": "IT Director UIN",
    "job_desarrollador": "Software Developer",
    "job_ia": "Programming Specialist, Data Analyst, and AI Project Manager",
    "job_php_ai": "PHP, Codeigniter, Python, AI Developer",

    "company_fortes": "FORTES Center, University of Information Sciences (UCI)",
    "company_sitrans": "SITRANS Company",
    "company_ingenius": "SME Ingenius SURL",
    "company_uin": "UIN TIC Development",
    "company_routetogrow": "RouteToGrow",

    "desc_fortes": "Leader of the multimedia and educational games production line. Coordination of technical teams and design of interactive content.",
    "desc_sitrans": "Led the development of key systems such as: <em>Viajando</em> APK, <em>CONDOR</em> accounting system, and <em>TRANSIPACK</em> logistics platform. Web portal development, strategic project planning, and technical leadership of multidisciplinary teams.",
    "desc_director": "IT department leadership, supervision of technology projects, and IT infrastructure management.",
    "desc_ingenius": "Participation in the development of technological solutions for SMEs, focused on automation and operational efficiency.",
    "desc_uin": "Leadership in the development and maintenance of the <em>Viajando</em> platform. Coordination of teams in technology projects for the Ministry of Transport, with AI integration and data analysis.",
    "desc_routetogrow": "Development of AI-integrated features for CRM.",

    "edu_engineer": "Computer Science Engineer",
    "edu_diploma": "Diploma in Networks and Computer Security",
    "edu_uci": "University of Information Sciences",
    "edu_cecan": "CECAN-SEPSA",
    "edu_havana": "Havana-Cuba",
    "edu_havana_short": "Havana",

    "portfolio_viajando": "APK Viajando",
    "portfolio_condor": "CONDOR Accounting System",
    "portfolio_transipack": "TRANSIPACK",
    "portfolio_cubex": "Cubanacan Express Website",
    "portfolio_reporte": "Support Reporting System",
    "portfolio_ip": "Automatic IP Assignment System",
    "portfolio_esquina": "The Red Corner",
    "portfolio_comicasa": "COMICASA. Glide - Make - Stripe Integration",
    "portfolio_n8n": "Sales Agent",
    "portfolio_powerbi": "PowerBI Dashboard",
    "portfolio_siescribo":"Social network SIESCRIBO",
    "portfolio_efirma":"Website EFIRMA.cu",

    "desc_viajando": "Mobile application for travel and transportation management in Cuba. I led its development from scratch and its ongoing maintenance.",
    "desc_condor": "Accounting system for financial management of companies. I implemented key functionalities and ensured its integration with other systems.",
    "desc_transipack": "Package platform that optimizes shipping logistics. I participated in its design and development, focusing on user experience.",
    "desc_cubex": "Web portal for managing shipments and logistics. I collaborated in its development and in implementing continuous improvements.",
    "desc_reporte": "Reporting system for visualizing key data. I developed its architecture and ensured its scalability.",
    "desc_ip": "System for automatic IP assignment in networks. I implemented solutions that improved the efficiency of the process.",
    "desc_esquina": "Platform for cultural and artistic management. I led its development and promotion in the community.",
    "desc_comicasa": "Integration of tools like Glide, Make, and Stripe to optimize processes in COMICASA.",
    "desc_n8n": "Development of a sales agent using n8n, improving the automation of business processes.",
    "desc_powerbi": "Interactive dashboard in PowerBI for visualizing business data.",
    "desc_siescribo":"Social network for writers, allowing for book sales and socializing with readers and writers.",
    "desc_efirma":"Promotional web portal integration for requesting digital signatures in Cuba.",

    "tech_os": "Operating Systems",
    "tech_vm": "Virtual Machines",
    "tech_servers": "Servers",
    "tech_db": "Databases",
    "tech_frontend": "Frontend",
    "tech_backend": "Backend",
    "tech_frameworks": "Frameworks",
    "tech_cms": "CMS",
    "tech_ai": "AI",
    "tech_other": "Other Tools",
    "tech_methods": "Methodologies",
    "tech_gateways": "Payment Gateways",

    "comp_design": "Experience in designing, developing, and maintaining applications and systems",
    "comp_lead": "Ability to lead work teams",
    "comp_solve": "Skill in identifying and efficiently solving technical problems",
    "comp_collab": "Ability to collaborate with professionals from different areas",
    "comp_project": "Experience in planning and executing software development projects",
    "comp_infra": "Infrastructure deployment",
    "comp_update": "Interest in staying up to date with the latest technologies",
    "comp_incidents": "Hardware/software incident resolution",
    "comp_scripting": "Scripting (Python, Bash) to optimize repetitive tasks",
    "comp_innovate": "Ability to propose innovative solutions to technical problems",
    "comp_analyze": "Ability to analyze and evaluate different approaches to solving technical problems",
    "comp_data": "Data analysis",
    "comp_ai": "Integration with AI models",
    "comp_migrate": "Planning of technological migrations (e.g.: legacy system updates)",
    "comp_testing": "Manual and semi-automated testing",
    "comp_crm": "Experience with CRM and accounting systems",
    "comp_cuban": "Knowledge of Cuban regulations (e.g.: NC-ISO 27001, Data Protection Law)",
    "comp_iso": "Knowledge of international standard ISO 9001:15",
    "comp_teams": "Leadership of technical teams (developers, QA, DevOps)",
    "comp_stakeholders": "Stakeholder management (clients, internal teams, suppliers)",
    "comp_budget": "Budget and ROI: Financial planning, cost control",
    "comp_risk": "Risk management: Identification and mitigation in tech environments",
    "comp_digital": "Digital transformation: Experience in cloud migration, AI, automation",
    "comp_product": "Product Manager: Product vision",
    "comp_innovation": "Innovation: Knowledge of tech trends (AI)",

    "testimonial_1": "Working with you has been an enriching experience: you are meticulous, collaborative, and always strive for excellence. Your dedication, patience, and passion elevate every project to its best version.",
    "testimonial_2": "My experience working with Alejandro has been one of the best in a long time. Seriousness, sacrifice, commitment, dedication. Professionalism above all.",
    "testimonial_3": "An IT specialist who brings clarity, commitment, and high-level technical solutions. A natural leader in complex environments.",
    "testimonial_4": "Working with Alejandro has been an excellent experience. His expertise in mobile app development and, especially, in payment gateway integration, is impressive. From selecting the most suitable solution to implementation and testing, Alejandro demonstrates a high level of technical knowledge and attention to detail. His ability to optimize payment processes and ensure secure transactions has been key to the success of our projects. Without a doubt, a highly recommended professional for any mobile development requiring reliable and efficient payment solutions.",
    "testimonial_5": "I had the pleasure of working alongside Alejandro. He's an excellent professional with experience leading teams and dealing with clients. In my short time at Sitrans, I saw him perform very well in all tasks, often under pressure at different times, which makes him excellent at solving problems under stress."
    }
}